In [7]:
import sys
!{sys.executable} -m pip install numpy
!{sys.executable} -m pip install pandas
!{sys.executable} -m pip install pandasql
import numpy as np
import pandas as pd
from pandasql import *
heroes = pd.read_csv("heroes_information.csv")

pysqldf = lambda q: sqldf(q,globals())

Requirement already satisfied: numpy in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (1.19.1)

WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the 'c:\users\juan_\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: pandas in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (1.1.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.19.1)
Requirement already satisfied: six>=1.5 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the 'c:\users\juan_\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the 'c:\users\juan_\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandasql) (1.19.1)
Requirement already satisfied: pandas in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandasql) (1.1.0)
Collecting sqlalchemy
  Downloading SQLAlchemy-1.3.18-cp38-cp38-win_amd64.whl (1.2 MB)
Requirement already satisfied: pytz>=2017.2 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandas->pandasql) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\juan_\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Using legacy setup.py install for pandasql, since package 'wheel' is not installed.
Installing collected packages: sqlalchemy, pandasql
    Running setup.py install for pandasql: started
    Running setup.py install for pandasql: finished with status 'done'
Successfully installed pandasql-0.7.3 sqlalchemy-1.3.18

In [31]:
# 1. what is the first name in heroes table?

In [29]:
q1 = " SELECT * FROM heroes LIMIT 1"
pysqldf(q1)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0

In [32]:
# 2. How many publisher exists?

In [12]:
q2 = "SELECT COUNT(DISTINCT Publisher) FROM heroes"
pysqldf(q2)

   COUNT(DISTINCT Publisher)
0                         24

In [33]:
# 3. How many superheroes are taller than 2 meters (200 cms)?

In [14]:
q3 = "SELECT COUNT(*) FROM heroes WHERE Height > 200"
pysqldf(q3)

   COUNT(*)
0        59

In [34]:
# 4. How many superheroes are human and are taller than 2 meters (200 cms)?

In [16]:
q4 = "SELECT COUNT(*) FROM heroes WHERE Height > 200 AND race = 'Human'"
pysqldf(q4)

   COUNT(*)
0        12

In [35]:
# 5. How many superheroes weigh more than 100 lbs and less than 200 lbs?

In [18]:
q5 = "SELECT COUNT(*) FROM heroes WHERE Weight BETWEEN 100 AND 200"
pysqldf(q5)

   COUNT(*)
0        98

In [36]:
# 6.How many superheroes have blue or red eyes?

In [20]:
q6 = "SELECT COUNT(*) FROM heroes WHERE `Eye color` in ('red', 'blue')"
pysqldf(q6)

   COUNT(*)
0       271

In [37]:
# 7. How many superheroes are Human, Mutant and have Green hair or are Vampires with black hair?

In [22]:
q7 = "SELECT COUNT(*) FROM heroes WHERE (Race in ('Human', 'Mutant') AND `Hair color` = 'Green') OR (Race = 'Vampire' AND `Hair color` = 'Black')"
pysqldf(q7)

   COUNT(*)
0         5

In [38]:
# 8. What is the name of the first superhero if I sort the table by race in order falling?

In [24]:
q8 = "SELECT Name FROM heroes ORDER BY Race DESC LIMIT 1"
pysqldf(q8)

             name
0  Solomon Grundy

In [39]:
# 9. How many superheroes are male and how many female?

In [26]:
q9 = "SELECT Gender, count(*) FROM heroes GROUP BY Gender"
pysqldf(q9)

   Gender  count(*)
0    None        29
1  Female       200
2    Male       505

In [40]:
# 10. How many publishing houses have more than 15 superheroes?

In [28]:
q10 = "SELECT Publisher, count(name) FROM heroes GROUP BY Publisher HAVING COUNT(Publisher) > 15"
pysqldf(q10)

           Publisher  count(name)
0          DC Comics          215
1  Dark Horse Comics           18
2      Marvel Comics          388
3       NBC - Heroes           19